Tekla Open API Reference for Tekla Structures 2025
AnalysisObject.FatherObject2Type Property
 Gets or sets the type of the father object.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObject.AnalysisObjectEnum FatherObject2Type { get; set; }
Public Property FatherObject2Type As AnalysisObject.AnalysisObjectEnum
	Get
	Set
Property Value
Type: AnalysisObject.AnalysisObjectEnum
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace